Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By default the generated uber JAR file name will have the `-runner` suffix, unless it was overridden by configuring a custom one with `quarkus.package.jar.runner-suffix` configuration option. If the runner suffix is not desired, it can be disabled by setting `quarkus.package.jar.add-runner-suffix` configuration option to `false`, in which case the uber JAR will replace the original JAR file generated by `maven-jar-plugin` for the application module.
ja_jp: デフォルトでは、生成されるuber JARファイル名は、 `quarkus.package.jar.runner-suffix` 設定オプションでカスタムサフィックスを設定することで上書きされない限り、 `-runner` サフィックスを持ちます。 ランナーサフィックスが不要な場合は、 `quarkus.package.jar.add-runner-suffix` コンフィギュレーションオプションを `false` に設定することで無効にできます。 この場合、uber JAR は `maven-jar-plugin` によって生成されたオリジナルの JAR ファイルをアプリケーションモジュール用に置き換えます。

source: By default the generated uber JAR file name will have the `-runner` suffix, unless it was overriden by configuring a custom one with `quarkus.package.runner-suffix` configuration option. If the runner suffix is not desired, it can be disabled by setting `quarkus.package.add-runner-suffix` configuration option to `false`, in which case the uber JAR will replace the original JAR file generated by `maven-jar-plugin` for the application module.
ja_jp: デフォルトでは、 `quarkus.package.runner-suffix` 設定オプションを使用してカスタムファイルを設定することによってオーバーライドされない限り、生成された uber JAR ファイル名には `-runner` 接尾辞が付きます。ランナーサフィックスが不要な場合は、 `quarkus.package.add-runner-suffix` 設定オプションを `false` に設定することで無効にできます。この場合、uber JAR は、アプリケーションモジュールに対して `maven-jar-plugin` によって生成された元の JAR ファイルを置き換えます。

source: By default the logout is based on the expiration time of the ID Token issued by the OpenID Connect Provider. When the ID Token expires, the current user session at the Quarkus endpoint is invalidated and the user is redirected to the OpenID Connect Provider again to authenticate. If the session at the OpenID Connect Provider is still active, users are automatically re-authenticated without having to provide their credentials again.
ja_jp: デフォルトでは、ログアウトはOpenID Connect Providerが発行したID Tokenの有効期限に基づいて行われます。IDトークンの有効期限が切れると、Quarkusエンドポイントでの現在のユーザーセッションは無効になり、ユーザーは認証のために再度OpenID Connect Providerにリダイレクトされます。OpenID Connect Providerでのセッションがまだアクティブな場合は、ユーザーは再び資格情報を提供することなく自動的に再認証されます。

source: By default the token endpoint address is discovered by adding a `/.well-known/openid-configuration` path to the configured `quarkus.oidc-client.auth-server-url`.
ja_jp: デフォルトでは、設定された `quarkus.oidc-client.auth-server-url` に `/.well-known/openid-configuration` のパスを追加することで、トークンのエンドポイントアドレスが検出されます。

source: By default they are discovered by adding a `/.well-known/openid-configuration` path to the configured `quarkus.oidc.auth-server-url`.
ja_jp: デフォルトでは、設定された `quarkus.oidc.auth-server-url` に `/.well-known/openid-configuration` パスを追加することで検出されます。

source: By default this resource will be disabled, and the user has to enable it in Dev UI. You can change this default by adding `.enableMcpFuctionByDefault()` in the builder method.
ja_jp: デフォルトではこのリソースは無効になっており、ユーザーは Dev UI で有効にする必要があります。ビルダーメソッドで `.enableMcpFuctionByDefault()` を追加することで、このデフォルトを変更できます。

source: By default this tool will be disabled, and the user has to enable it in Dev UI. You can change this default by adding `.enableMcpFuctionByDefault()` in the builder method.
ja_jp: デフォルトではこのツールは無効になっており、ユーザーは Dev UI で有効にする必要があります。ビルダーメソッドで `.enableMcpFuctionByDefault()` を追加することで、このデフォルトを変更できます。

source: By default this tool will be disabled, and the user has to enable it in Dev UI. You can change this default by adding the `@DevMCPEnableByDefault` annotation on the method.
ja_jp: デフォルトではこのツールは無効になっており、ユーザーは Dev UI で有効にする必要があります。メソッドに `@DevMCPEnableByDefault` アノテーションを付けることで、このデフォルトを変更できます。

source: By default when a Quarkus application starts (in regular or dev mode), it will display an ASCII art banner. The banner can be disabled by setting `quarkus.banner.enabled=false` in `application.properties`, by setting the `-Dquarkus.banner.enabled=false` Java System Property, or by setting the `QUARKUS_BANNER_ENABLED` environment variable to `false`. Furthermore, users can supply a custom banner by placing the banner file in `src/main/resources` and configuring `quarkus.banner.path=name-of-file` in `application.properties`.
ja_jp: デフォルトでは、Quarkus アプリケーションが起動すると (通常モードまたは開発モードで) 、ASCII アートバナーが表示されます。バナーを無効にするには、 `application.properties` で `quarkus.banner.enabled=false` を設定するか、 `Dquarkus.banner.enabled=false` の Java システムプロパティーを設定するか、 `QUARKUS_BANNER_ENABLED` 環境変数を `false` に設定します。 さらに、 `src/main/resources` にバナーファイルを配置し、 `application.properties` に `quarkus.banner.path=nam-of-file` を設定することで、ユーザーはカスタムのバナーを提供することができます。

source: By default, ArC does not perform all validations required by the CDI specification. It also improves CDI usability in many ways, some of them being directly against the specification.
ja_jp: デフォルトでは、ArC は CDI 仕様で要求される全てのバリデーションを実行するわけではありません。また、多くの方法でCDIの使い勝手を向上させますが、その中には仕様に直接反するものもあります。

source: By default, CDI beans are created lazily, when needed. What exactly "needed" means depends on the scope of a bean.
ja_jp: デフォルトでは、CDI Bean は必要なときに作成されます。何を正確に「必要とされる」かは、Bean のスコープに依存します。

source: By default, Compose Dev Services looks for files in the project root named `compose-devservices.[yml|yaml]` or `docker-compose-devservices.[yml|yaml]`.
ja_jp: デフォルトでは、Compose Dev Services はプロジェクトのルートにある `compose-devservices.[yml|yaml]` または `docker-compose-devservices.[yml|yaml]` という名前のファイルを検索します。

source: By default, Compose Dev Services waits for all exposed ports to be available before considering a service ready. This behavior can be customized using labels:
ja_jp: デフォルトでは、Compose Dev Services は、サービスが準備完了と見なす前に、公開されているすべてのポートが利用可能になるまで待機します。この動作はラベルを使用してカスタマイズできます:

source: By default, Dev Services for AMQP picks a random port and configures the application. You can set the port by configuring the `quarkus.amqp.devservices.port` property.
ja_jp: 既定では、Dev Services for AMQP はランダムなポートを選択し、アプリケーションを構成します。ポートを設定するには、 `quarkus.amqp.devservices.port` プロパティを構成します。

source: By default, Dev Services for Apicurio Registry picks a random port and configures the application. You can set the port by configuring the `quarkus.apicurio-registry.devservices.port` property.
ja_jp: 既定では、Dev Services for Apicurio Registryはランダムなポートを選択してアプリケーションを設定します。 `quarkus.apicurio-registry.devservices.port` プロパティを設定することで、ポートを設定できます。

source: By default, Dev Services for Elasticsearch picks a random port and configures the application. You can set the port by configuring the `quarkus.elasticsearch.devservices.port` property.
ja_jp: デフォルトでは、Dev Services for Elasticsearchはランダムなポートを選び、アプリケーションを設定します。 `quarkus.elasticsearch.devservices.port` プロパティを設定することで、ポートを設定することができます。

source: By default, Dev Services for Infinispan picks a random port and configures the application. You can set the port by configuring the `quarkus.infinispan-client.devservices.port` property.
ja_jp: デフォルトでは、Infinispanの開発サービスはランダムなポートを選択し、アプリケーションを設定します。 ポートは `quarkus.infinispan-client.devservices.port` プロパティを設定することによって定義することができます。

source: By default, Dev Services for Kafka picks a random port and configures the application. You can set the port by configuring the `quarkus.kafka.devservices.port` property.
ja_jp: デフォルトでは、Kafka向けDev Services はランダムなポートを選択してアプリケーションを構成します。ポートは、 `quarkus.kafka.devservices.port` プロパティを構成することで設定できます。

source: By default, Dev Services for Kogito starts a Data Index using port 8180. You can set the port by configuring the `quarkus.kogito.devservices.port` property.
ja_jp: 既定では、Dev Services for Kogito はポート 8180 を使用してData Indexを開始します。ポートを設定するには、 `quarkus.kogito.devservices.port` プロパティを構成します。

source: By default, Dev Services for LRA picks a random port on which to run the LRA coordinator. You can set the port by configuring the `quarkus.lra.devservices.port` property. The connection property `quarkus.lra.coordinator-url` is automatically configured with the chosen port.
ja_jp: デフォルトでは、LRA 用 Dev Services は LRA コーディネーターを実行するランダムなポートを選択します。`quarkus.lra.devservices.port` 設定プロパティーを設定することでポートを設定できます。接続設定プロパティー `quarkus.lra.coordinator-url` は、選択されたポートで自動的に設定されます。

source: By default, Dev Services for Pulsar picks a random port and configures the application. You can set the port by configuring the `quarkus.pulsar.devservices.port` property.
ja_jp: デフォルトでは、Dev Services for Pulsar はランダムなポートを選択し、アプリケーションを設定します。 `quarkus.pulsar.devservices.port` プロパティーを設定することでポートを設定できます。

source: By default, Dev Services for RabbitMQ picks a random port and configures the application. You can set the port by configuring the `quarkus.rabbitmq.devservices.port` property.
ja_jp: 既定では、Dev Services for RabbitMQ はランダムなポートを選択し、アプリケーションを設定します。ポートを設定するには、 `quarkus.rabbitmq.devservices.port` プロパティを設定します。

source: By default, Dev Services for RabbitMQ use the official image with the `management` tag. This means you have the https://github.com/docker-library/docs/tree/master/rabbitmq#management-plugin[management plugin] available. You can use the xref:dev-ui.adoc[Dev UI] to find the HTTP port randomly affected or configure a static one by using `quarkus.rabbitmq.devservices.http-port`.
ja_jp: デフォルトでは、Dev Services for RabbitMQ は `management`タグ付きの公式イメージを使用します。つまり、https://github.com/docker-library/docs/tree/master/rabbitmq#management-plugin[management plugin] が利用可能になります。xref:dev-ui.adoc[Dev UI] を使用して、ランダムに影響を受ける HTTP ポートを見つけることができます。 または、`quarkus.rabbitmq.devservices.http-port` を使用して静的なポートを設定します。

source: By default, Dev Services for RabbitMQ use the official image with the `management` tag. This means you have the https://github.com/docker-library/docs/tree/master/rabbitmq#management-plugin[management plugin] available. You can use the xref:dev-ui.adoc[Dev UI] to find the HTTP port randomly affected or configure a static one via `quarkus.rabbitmq.devservices.http-port`.
ja_jp: デフォルトでは、Dev Services for RabbitMQは、 `management` タグの付いた公式イメージを使用します。これは、 link:https://github.com/docker-library/docs/tree/master/rabbitmq#management-plugin[管理プラグイン] が利用可能であることを意味します。 link:dev-ui.html[Dev UI] を使用してランダムに影響を受けるHTTPポートを見つけるか、 `quarkus.rabbitmq.devservices.http-port` から静的なポートを設定することができます。

source: By default, Gradle will wait for a connection on `localhost:5005`. Now, you can run your IDE `Remote` configuration to attach it to `localhost:5005`.
ja_jp: デフォルトでは、Gradle は、 `localhost:5005` 上の接続を待ちます。これで、 `localhost:5005` にアタッチするために、IDE `Remote` の設定を実行することができます。

source: By default, Hibernate Search sends a few requests to the Elasticsearch cluster on startup. If the Elasticsearch cluster is not necessarily up and running when Hibernate Search starts, this could cause a startup failure.
ja_jp: デフォルトではHibernate Search は起動時に Elasticsearch クラスタにいくつかのリクエストを送信します。Hibernate Searchの起動時にElasticsearchクラスタが稼働していない場合は起動失敗の原因となります。

source: By default, Hibernate attempts to connect to the database at startup to fetch metadata. This is useful, for example, to validate the schema or create some temporary tables, making the startup process smoother and more user-friendly.
ja_jp: デフォルトでは、Hibernate は起動時にデータベースへの接続を試み、メタデータを取得します。これは、たとえばスキーマの検証や一時テーブルの作成に役立ち、起動プロセスをよりスムーズでユーザーフレンドリーなものにします。

source: By default, JaCoCo will save the collected data in `target/jacoco-quarkus.exec` and the generated report is located in `target/jacoco-report`. For multi-module projects, more config properties will be needed. Typically, `quarkus.jacoco.data-file=/path/to/shared/data-file`, `quarkus.jacoco.reuse-data-file=true` and `quarkus.jacoco.aggregate-report-data=true`. See xref:tests-with-coverage.adoc[Measuring the coverage of your tests] for more information.
ja_jp: デフォルトでは、JaCoCo は収集したデータを `target/jacoco-quarkus.exec` に保存し、生成されたレポートは `target/jacoco-report` に配置されます。マルチモジュールプロジェクトの場合は、さらに多くの設定プロパティーが必要になります。通常は、`quarkus.jacoco.data-file=/path/to/shared/data-file`、`quarkus.jacoco.reuse-data-file=true`、および `quarkus.jacoco.aggregate-report-data=true` です。詳細は xref:tests-with-coverage.adoc[テストのカバレッジを測定する] を参照してください。

source: By default, Jackson uses reflection to convert objects to and from JSON. However, {project-name} follows a build-time optimization philosophy. To align with this approach, configure your application to minimize reflection by using the link:https://quarkus.io/extensions/io.quarkus/quarkus-rest-jackson[`quarkus-rest-jackson`] extension.
ja_jp: デフォルトでは、Jacksonはリフレクションを使用してオブジェクトをJSONに変換します。 ただし、{project-name}はビルド時間の最適化という考え方に従っています。 このアプローチに合わせるには、 link:https://quarkus.io/extensions/io.quarkus/quarkus-rest-jackson[quarkus-rest-jackson] エクステンションを使用してリフレクションを最小化するようにアプリケーションを構成します。

source: By default, Liquibase MongoDB is configured to use the default MongoDB client Quarkus creates, but you can configure the extension to use a named client by setting `quarkus.liquibase-mongodb.mongo-client-name`.
ja_jp: デフォルトでは、Liquibase MongoDB は Quarkus が作成するデフォルトの MongoDB クライアントを使うように設定されていますが、 `quarkus.liquibase-mongodb.mongo-client-name` を設定することで、指定したクライアントを使うようにエクステンションを設定できます。

source: By default, Maven will wait for a connection on `localhost:5005`.
ja_jp: デフォルトでは、Maven は `localhost:5005` で接続を待ちます。

source: By default, Maven will wait for a connection on `localhost:8000`. Now, you can run your IDE `Remote` configuration to attach it to `localhost:8000`.
ja_jp: デフォルトでは、Maven は、 `localhost:8000` 上の接続を待ちます。これで、 `localhost:8000` にアタッチするために、IDE `Remote` の設定を実行することができます。

source: By default, OIDC client refreshes the token during the current request, when it detects that it has expired, or nearly expired if the xref:#quarkus-oidc-client_quarkus-oidc-client-refresh-token-time-skew[refresh token time skew] is configured. Performance critical applications may want to avoid having to wait for a possible token refresh during the incoming requests and configure an asynchronous token refresh instead, for example:
ja_jp: デフォルトでは、OIDC クライアントは、トークンが期限切れになっていることを検出した場合、または xref:#quarkus-oidc-client_quarkus-oidc-client-refresh-token-time-skew[リフレッシュトークンの時間差] が設定されている場合は期限切れに近づいていると検出した場合に、現在のリクエスト中にトークンを更新します。パフォーマンスが重要なアプリケーションでは、受信リクエスト中にトークンの更新を待つことを避け、代わりに非同期トークン更新を設定したい場合があります。例:

source: By default, OpenAPI filters apply to all documents. This can be changed by configuring `@OpenApiFilter#documentNames`.
ja_jp: デフォルトでは、OpenAPI フィルターはすべてのドキュメントに適用されます。これは `@OpenApiFilter#documentNames` を設定することで変更できます。

source: By default, PEM, JWK or JWK key sets can be read from the local file system or fetched from URIs as required by MicroProfile JWT specification. Set this property to `AWS_ALB` to support an AWS Application Load Balancer verification key resolution.
ja_jp: デフォルトでは、PEM、JWK、または JWK キーセットは、ローカルファイルシステムから読み取るか、MicroProfile JWT 仕様で要求される URI から取得できます。AWS Application Load Balancer の検証キー解決をサポートするには、このプロパティを `AWS_ALB` に設定します。

source: By default, PEM, JWK, or JWK key sets can be read from the local file system or fetched from URIs as required by MicroProfile JWT specification. Set this property to `AWS_ALB` to support an AWS Application Load Balancer verification key resolution.
ja_jp: デフォルトでは、PEM、JWK、または JWK キーセットは、MicroProfile JWT 仕様で要求されているように、ローカルファイルシステムから読み取ったり、URI から取得したりできます。AWS Application Load Balancer 検証キー解決をサポートするには、このプロパティーを `AWS_ALB` に設定します。

source: By default, Protobuf Schemas will also be uploaded to the backup clusters. However, it might be required to handle the registration manually as a schema may evolve over time when used in production, so you can disable this from occurring in each backup site by configuring the `quarkus.infinispan-client.backup-cluster.YOUR_SITE_NAME.use-schema-registration` to `false`. The value of this property will be ignored if the `use-schema-registration` global property is `false`.
ja_jp: デフォルトでは、Protobufスキーマはバックアップクラスタにもアップロードされます。ただし、スキーマが本番環境で使用される際に時間の経過とともに進化する可能性があるため、登録を手動で処理する必要がある場合があります。このため、 `quarkus.infinispan-client.backup-cluster.YOUR_SITE_NAME.use-schema-registration` を `false` に設定することで、各バックアップサイトでこの処理が発生しないようにすることができます。 `use-schema-registration` グローバルプロパティが `false` の場合、このプロパティの値は無視されます。

source: By default, Protobuf schemas generated this way will be registered by this extension when the client first connects. However, it might be required to handle the registration manually as a schema may evolve over time when used in production, so you can disable this from occurring by configuring the `quarkus.infinispan-client.use-schema-registration` to `false`.
ja_jp: デフォルトでは、この方法で生成されたProtobufスキーマは、クライアントが最初に接続したときに、このエクステンションによって登録されます。 しかし、実運用で使用しているとスキーマが時間の経過とともに進化する可能性があるため、手動で登録を処理する必要があるかもしれません。そのため、 `quarkus.infinispan-client.use-schema-registration` を `false` に設定して、この現象を無効にすることができます。

source: By default, Quarkus Cache uses Caffeine as backend. It's possible to use Infinispan instead.
ja_jp: デフォルトでは、Quarkus Cache はバックエンドとして Caffeine を使用します。 代わりに Infinispan を使用することも可能です。

source: By default, Quarkus Cache uses Caffeine as backend. It's possible to use Redis instead.
ja_jp: デフォルトでは、Quarkus CacheはバックエンドとしてCaffeineを使用します。代わりにRedisを使用することも可能です。

source: By default, Quarkus GitHub provider submits the client id and secret in the HTTP Authorization header. However, GitHub may require that both client id and secret are submitted as form parameters instead. When you get HTTP 401 error after logging in to GitHub and being redirected back to Quarkus MCP server, replace the `quarkus.oidc.credentials.secret=<Secret>` property with the following two properties instead:
ja_jp: デフォルトでは、Quarkus GitHub プロバイダーは HTTP Authorization ヘッダーにクライアント ID とシークレットを送信します。しかし、GitHub は代わりにクライアント ID とシークレットの両方をフォームパラメーターとして送信することを要求する場合があります。GitHub にログインして Quarkus MCP サーバーにリダイレクトされた後に HTTP 401 エラーが発生した場合は、`quarkus.oidc.credentials.secret=<Secret>` プロパティーを以下の 2 つのプロパティーに置き換えてください。

source: By default, Quarkus OIDC adds a `.well-known/openid-configuration` path segment to this URL and discovers the OIDC provider metadata. The discovery path can be customized with `quarkus.oidc.discovery-path`, for example, it can be set to `.well-known/oauth-authorization-server`.
ja_jp: デフォルトでは、 Quarkus OIDC はこの URL に `.well-known/openid-configuration` パスセグメントを追加し、 OIDC プロバイダーのメタデータを検出します。 ディスカバリーパスは `quarkus.oidc.discovery-path` でカスタマイズでき、たとえば `.well-known/oauth-authorization-server` に設定することが可能です。

source: By default, Quarkus attempts to determine the IP address using the first available, non-loopback network interface. If this fails, it falls back to `localhost`.
ja_jp: デフォルトでは、Quarkus は最初に使用可能なループバック以外のネットワークインターフェースを使用して IP アドレスを特定しようとします。これに失敗した場合は `localhost` にフォールバックします。

source: By default, Quarkus automatically detects the container runtime. If you want to explicitly select the container runtime, you can do it with:
ja_jp: デフォルトでは、Quarkus はコンテナーランタイムを自動的に検出します。 コンテナーランタイムを明示的に選択したい場合は、次のようにします:

source: By default, Quarkus automatically uses the current request path as the callback path. But you can override the default behavior and configure a specific callback path by setting the Quarkus `quarkus.oidc.authentication.redirect-path` property.
ja_jp: デフォルトでは、Quarkus は現在のリクエストパスをコールバックパスとして自動的に使用します。 ただし、Quarkus の `quarkus.oidc.authentication.redirect-path` プロパティーを設定することで、デフォルトの動作をオーバーライドし、特定のコールバックパスを設定できます。

source: By default, Quarkus does not generate these descriptors. Quarkus does provide several configuration options for generating them. These would be added to your `application.properties` or `application.yml` file:
ja_jp: デフォルトでは、Quarkus はこれらの記述子を生成しません。Quarkus は、これらを生成するためのいくつかの設定オプションを提供します。これらは、 `application.properties` または `application.yml` ファイルに追加されます。

source: By default, Quarkus does proactive authentication, which means that all incoming requests with credentials are authenticated regardless of whether the target page requires authentication. For more information, see xref:security-built-in-authentication.adoc#proactive-authentication[Proactive authentication].
ja_jp: デフォルトでは、Quarkusはプロアクティブ認証を行います。つまり、ターゲットページが認証を必要としているかどうかにかかわらず、クレデンシャルを持つすべての着信リクエストが認証されます。詳細については、 link:security-built-in-authentication-support-concept.html#proactive-authentication[プロアクティブ認証] を参照してください。

source: By default, Quarkus does what we call proactive authentication. This means that if an incoming request has a credential then that request will always be authenticated (even if the target page does not require authentication).
ja_jp: デフォルトでは、Quarkusはプロアクティブ認証と呼ばれる認証を行います。これは、受信したリクエストにクレデンシャルがある場合、そのリクエストは常に認証されます(ターゲットページが認証を必要としない場合でも)。

source: By default, Quarkus doesn't cache the credentials obtained from the LDAP directory. Every request to your service will cause an additional roundtrip to the LDAP server.
ja_jp: デフォルトでは、QuarkusはLDAPディレクトリから取得した認証情報をキャッシュしません。 サービスへのリクエストごとに、LDAPサーバーへのラウンドトリップが発生します。

source: By default, Quarkus exposes the _management_ endpoints under `/q` on the main HTTP server. The same HTTP server provides the application endpoints and the management endpoints.
ja_jp: デフォルトでは、Quarkus はメイン HTTP サーバーの `/q` 以下に、_マネジメント_ エンドポイントを公開します。 同じ HTTP サーバーで、アプリケーションエンドポイントとマネジメントエンドポイントが提供されます。

source: By default, Quarkus generates the class list of the classes included in your application (including the classes generated by Quarkus). So, you do not have to repeat them in the `quarkus-preload-classes.txt` file.
ja_jp: デフォルトでは、（Quarkus で生成されたクラスも含む）アプリケーションに含まれるクラスのクラスリストが生成されま す。そのため、 `quarkus-preload-classes.txt` ファイルでこれらを繰り返す必要はありません。

source: By default, Quarkus initializes all classes at build time.
ja_jp: デフォルトでは、Quarkus はビルド時にすべてのクラスを初期化します。

source: By default, Quarkus listens on port 8080, and it's also the Cloud Run default port. No need to use the `PORT` environment variable defined in Cloud Run to customize the Quarkus HTTP port.
ja_jp: デフォルトでは、Quarkusは8080番ポートをリッスンし、これはCloud Runのデフォルトポートでもあります。Cloud Runで定義された環境変数 `PORT` を使用して、QuarkusのHTTPポートをカスタマイズする必要はありません。

source: By default, Quarkus listens to port 8443 for SSL secured connections and 8444 when running tests.
ja_jp: デフォルトでは、Quarkusは、SSLで保護された接続にポート8443を、テストの実行時にはポート8444をリッスンします。

source: By default, Quarkus omits the namespace in the generated manifests, rather than enforce the `default` namespace. That means that you can apply the manifest to your chosen namespace when using `kubectl`, which in the example below is `test`:
ja_jp: デフォルトでは、Quarkusは生成されたマニフェストの名前空間を省略し、 `default` 名前空間を強制しません。つまり、 `kubectl` (以下の例では `test` )を使用している場合は、選択したネームスペースにマニフェストを適用することができます。

source: By default, Quarkus only supports <<path-based-authentication>> for one authentication mechanism per path. If more than one authentication mechanism must be used for the path-based authentication, you can write a custom `HttpAuthenticationMechanism` as documented in the xref:security-customization.adoc#dealing-with-more-than-one-http-auth-mechanisms[Dealing with more than one HttpAuthenticationMechanism] section of the Security Tips and Tricks guide. Another option is to enable <<inclusive-authentication>> in the lax mode and write a custom `HttpSecurityPolicy` or `PermissionChecker` that verifies that all registered HTTP authentication mechanisms created their mechanism-specific `SecurityIdentity`.
ja_jp: デフォルトでは、Quarkus はパスごとに 1 つの認証メカニズムに対してのみ <<path-based-authentication>> をサポートします。 パスベースの認証に複数の認証メカニズムを使用する必要がある場合は、「セキュリティに関するヒントとコツ」ガイドの xref:security-customization.adoc#dealing-with-more-than-one-http-auth-mechanisms[複数の HttpAuthenticationMechanism の処理] セクションに記載されているように、カスタムの `HttpAuthenticationMechanism` を記述できます。 もう 1 つの方法は、lax モードで <<inclusive-authentication>> を有効にし、登録されているすべての HTTP 認証メカニズムがメカニズム固有の `SecurityIdentity` を作成したことを確認するカスタムの `HttpSecurityPolicy` または `PermissionChecker` を記述することです。
